---
kind: property
id: P:Autodesk.Revit.DB.ImageBackgroundSettings.OffsetWidth
source: html/d5d39249-9b82-2220-6e4c-dbbb9d4a7393.htm
---
# Autodesk.Revit.DB.ImageBackgroundSettings.OffsetWidth Property

The horizontal offset of the rendering image to the rendering region.

## Syntax (C#)
```csharp
public double OffsetWidth { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: The given value for width must be no more than 30000 feet in absolute value.